PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p16f1776.inc
;----- COG3STR Bits -----------------------------------------------------
STRA             EQU  H'0000'
STRB             EQU  H'0001'
STRC             EQU  H'0002'
STRD             EQU  H'0003'
SDATA            EQU  H'0004'
SDATB            EQU  H'0005'
SDATC            EQU  H'0006'
SDATD            EQU  H'0007'

G3STRA           EQU  H'0000'
G3STRB           EQU  H'0001'
G3STRC           EQU  H'0002'
G3STRD           EQU  H'0003'
G3SDATA          EQU  H'0004'
G3SDATB          EQU  H'0005'
G3SDATC          EQU  H'0006'
G3SDATD          EQU  H'0007'


;----- CM4CON0 Bits -----------------------------------------------------
SYNC_CM4CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM4CON0      EQU  H'0004'
OUT_CM4CON0      EQU  H'0006'
ON_CM4CON0       EQU  H'0007'

C4SYNC           EQU  H'0000'
C4HYS            EQU  H'0001'
C4SP             EQU  H'0002'
C4ZLF            EQU  H'0003'
C4POL            EQU  H'0004'
C4OUT            EQU  H'0006'
C4ON             EQU  H'0007'


;----- CM4CON1 Bits -----------------------------------------------------
INTN_CM4CON1     EQU  H'0000'
INTP_CM4CON1     EQU  H'0001'

C4INTN           EQU  H'0000'
C4INTP           EQU  H'0001'


;----- CM4NSEL Bits -----------------------------------------------------
C4NCH0           EQU  H'0000'
C4NCH1           EQU  H'0001'
C4NCH2           EQU  H'0002'
C4NCH3           EQU  H'0003'


;----- CM4PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C4PCH0           EQU  H'0000'
C4PCH1           EQU  H'0001'
C4PCH2           EQU  H'0002'
C4PCH3           EQU  H'0003'


;----- CM5CON0 Bits -----------------------------------------------------
SYNC_CM5CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM5CON0      EQU  H'0004'
OUT_CM5CON0      EQU  H'0006'
ON_CM5CON0       EQU  H'0007'

C5SYNC           EQU  H'0000'
C5HYS            EQU  H'0001'
C5SP             EQU  H'0002'
C5ZLF            EQU  H'0003'
C5POL            EQU  H'0004'
C5OUT            EQU  H'0006'
C5ON             EQU  H'0007'


;----- CM5CON1 Bits -----------------------------------------------------
INTN_CM5CON1     EQU  H'0000'
INTP_CM5CON1     EQU  H'0001'

C5INTN           EQU  H'0000'
C5INTP           EQU  H'0001'


;----- CM5NSEL Bits -----------------------------------------------------
C5NCH0           EQU  H'0000'
C5NCH1           EQU  H'0001'
C5NCH2           EQU  H'0002'
C5NCH3           EQU  H'0003'


;----- CM5PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C5PCH0           EQU  H'0000'
C5PCH1           EQU  H'0001'
C5PCH2           EQU  H'0002'
C5PCH3           EQU  H'0003'


;----- CM6CON0 Bits -----------------------------------------------------
SYNC_CM6CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM6CON0      EQU  H'0004'
OUT_CM6CON0      EQU  H'0006'
ON_CM6CON0       EQU  H'0007'

C6SYNC           EQU  H'0000'
C6HYS            EQU  H'0001'
C6SP             EQU  H'0002'
C6ZLF            EQU  H'0003'
C6POL            EQU  H'0004'
C6OUT            EQU  H'0006'
C6ON             EQU  H'0007'


;----- CM6CON1 Bits -----------------------------------------------------
INTN_CM6CON1     EQU  H'0000'
INTP_CM6CON1     EQU  H'0001'

C6INTN           EQU  H'0000'
C6INTP           EQU  H'0001'


;----- CM6NSEL Bits -----------------------------------------------------
C6NCH0           EQU  H'0000'
C6NCH1           EQU  H'0001'
C6NCH2           EQU  H'0002'
C6NCH3           EQU  H'0003'


;----- CM6PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C6PCH0           EQU  H'0000'
C6PCH1           EQU  H'0001'
C6PCH2           EQU  H'0002'
C6PCH3           EQU  H'0003'


;----- PWMEN Bits -----------------------------------------------------
MPWM5EN          EQU  H'0000'
MPWM6EN          EQU  H'0001'
MPWM11EN         EQU  H'0002'


;----- PWMLD Bits -----------------------------------------------------
MPWM5LD          EQU  H'0000'
MPWM6LD          EQU  H'0001'
MPWM11LD         EQU  H'0002'


;----- PWMOUT Bits -----------------------------------------------------
MPWM5OUT         EQU  H'0000'
MPWM6OUT         EQU  H'0001'
MPWM11OUT        EQU  H'0002'


;----- PWM5PHL Bits -----------------------------------------------------
PWM5PHL0         EQU  H'0000'
PWM5PHL1         EQU  H'0001'
PWM5PHL2         EQU  H'0002'
PWM5PHL3         EQU  H'0003'
PWM5PHL4         EQU  H'0004'
PWM5PHL5         EQU  H'0005'
PWM5PHL6         EQU  H'0006'
PWM5PHL7         EQU  H'0007'



;----- PWM5PHH Bits -----------------------------------------------------
PWM5PHH0         EQU  H'0000'
PWM5PHH1         EQU  H'0001'
PWM5PHH2         EQU  H'0002'
PWM5PHH3         EQU  H'0003'
PWM5PHH4         EQU  H'0004'
PWM5PHH5         EQU  H'0005'
PWM5PHH6         EQU  H'0006'
PWM5PHH7         EQU  H'0007'



;----- PWM5DCL Bits -----------------------------------------------------
PWM5DCL0         EQU  H'0000'
PWM5DCL1         EQU  H'0001'
PWM5DCL2         EQU  H'0002'
PWM5DCL3         EQU  H'0003'
PWM5DCL4         EQU  H'0004'
PWM5DCL5         EQU  H'0005'
PWM5DCL6         EQU  H'0006'
PWM5DCL7         EQU  H'0007'



;----- PWM5DCH Bits -----------------------------------------------------
PWM5DCH0         EQU  H'0000'
PWM5DCH1         EQU  H'0001'
PWM5DCH2         EQU  H'0002'
PWM5DCH3         EQU  H'0003'
PWM5DCH4         EQU  H'0004'
PWM5DCH5         EQU  H'0005'
PWM5DCH6         EQU  H'0006'
PWM5DCH7         EQU  H'0007'



;----- PWM5PRL Bits -----------------------------------------------------
PWM5PRL0         EQU  H'0000'
PWM5PRL1         EQU  H'0001'
PWM5PRL2         EQU  H'0002'
PWM5PRL3         EQU  H'0003'
PWM5PRL4         EQU  H'0004'
PWM5PRL5         EQU  H'0005'
PWM5PRL6         EQU  H'0006'
PWM5PRL7         EQU  H'0007'



;----- PWM5PRH Bits -----------------------------------------------------
PWM5PRH0         EQU  H'0000'
PWM5PRH1         EQU  H'0001'
PWM5PRH2         EQU  H'0002'
PWM5PRH3         EQU  H'0003'
PWM5PRH4         EQU  H'0004'
PWM5PRH5         EQU  H'0005'
PWM5PRH6         EQU  H'0006'
PWM5PRH7         EQU  H'0007'



;----- PWM5OFL Bits -----------------------------------------------------
PWM5OFL0         EQU  H'0000'
PWM5OFL1         EQU  H'0001'
PWM5OFL2         EQU  H'0002'
PWM5OFL3         EQU  H'0003'
PWM5OFL4         EQU  H'0004'
PWM5OFL5         EQU  H'0005'
PWM5OFL6         EQU  H'0006'
PWM5OFL7         EQU  H'0007'



